
exports.boxLayouts =[
    //抽象的描述图片布局，依据抽象布局选取对于方法
    "四角","左右","上下","居中","左半","右半","上半","下半","左斜角","右斜角","多内容排列"
]


exports.paragraphLayouts =[
    //段落布局，关于段落的一些思考，标题，副标题，正文是否为一体？
    //我认为不应该视为一体，因为海报区别于报文，突出的是视觉感受，而不是单纯的节省空间，表述内容，极大可能为了突出主题单独表现标题
    "右对齐","左对齐","居中","左右对齐","顶对齐","底对齐","上下对齐"
]

exports.textLayouts =[ 
    //标题字布局
    //待完善
    "横向整齐","纵向整齐","横向错落","纵向错落",
    "错落斜线对角","田字整齐","田字错落"
]

exports.textScale ={
    //标题，副标题， 小标题，正文占比
    title:100,
    subhead:40,
    minTitle:30,
    content:20,
}

exports.layoutsProgram ={
    poster:{
        //海报布局
        //根据背景图 构图，对应相对合适的整体布局,此方案只适合海报结构
        //布局方式,四角,左右,上下,居中,左半,右半,上半,下半,左斜角,右斜角
        "居中":["四角","左右","上下","居中","左斜角","右斜角"],
        "平铺":["四角","左右","上下","居中","左半","右半","左斜角","右斜角"],
        "上":["上下","下半"],   
        "左上":["四角","左右","右半"],
        "右上":["四角","左右","左半"],
        "下":["上下","上半"],
        "左下":["四角","左右","右半"],
        "右下":["四角","左右","左半"],
        "左":["四角","左右","右半"],
        "右":["四角","左右","左半"],
    },
    longPicture:[
        //复杂信息长图布局
        "多内容排列"
    ]
}