exports.boxLayouts =[
    "四角","左右","上下","居中","左半","右半","上半","下半","左斜角","右斜角",
]

exports.boxLayouts =[
    "四角","左右","上下","居中","左半","右半","上半","下半","左斜角","右斜角",
]


exports.layoutsForLongPictrue ={
    //复杂信息长图布局
    poster:{
        //布局方式,四角,左右,上下,居中,左半,右半,上半,下半,左斜角,右斜角
        //根据背景图构图，对应相对合适的整体布局,此方案只适合海报结构
        "居中":["四角","左右","上下","居中","左斜角","右斜角"],
        "平铺":["四角","左右","上下","居中","左半","右半","左斜角","右斜角"],
        "上":["上下","下半"],   
        "左上":["四角","左右","右半"],
        "右上":["四角","左右","左半"],
        "下":["上下","上半"],
        "左下":["四角","左右","右半"],
        "右下":["四角","左右","左半"],
        "左":["四角","左右","右半"],
        "右":["四角","左右","左半"],
    }
}