exports.pictureStyles = {
    //整体风格应该更为具象，以便更容易模仿出该类风格
    // "整体风格":["现代商务","pop招贴",
    // "可爱少女","文艺清新","狂放霸气","简单大气",
    // "现代科技","朋克工业"]
    "沉稳现代商务":{
        font:[["写实"], ["有衬线", "无衬线"], ["圆润", "刚硬"], ["机刷"], ["简单", "复杂"], ["bold", "regular", "light"], ["简", "繁"]],
        background:[["沉稳"],["自然景观","古典建筑","现代建筑","商务成列"],["红","黄","蓝","黑白"],[1,2,3,4,5],[1,2,3],[1,2,3,4,5],["横构图","竖构图"],["居中","平铺","上","左上","右上","下","左下","右下","左","右"]]
    },
    "狂放现代商务":{
        font:[["毛笔","写实"], ["有衬线", "无衬线"], ["刚硬"], ["机刷","手写"], ["简单", "复杂"], ["bold", "regular", "light"], ["简", "繁"]],
        background:[["沉稳"],["自然景观","古典建筑","现代建筑","商务成列"],["红","黄","蓝","黑白"],[1,2,3,4,5],[1,2,3],[1,2,3,4,5],["横构图","竖构图"],["居中","平铺","上","左上","右上","下","左下","右下","左","右"]]
    }
}


exports.backgroundStyleObject={
    "图片情感":["热情","活泼","沉稳","安静","冷淡"],
    "分类":["自然景观","古典建筑","现代建筑","工业建筑","生活成列","商务成列","几何图形","肌理纹路"],
    "色系":["红","黄","蓝","绿","橙","紫","黑","白","多彩"],
    "明度":[1,2,3,4,5],//明度分5个档位
    "饱和度":[1,2,3,4,5],//饱和度分5个档位
    "对比度":[1,2,3,4,5],//对比度分5个档位
    "构图":["横构图","竖构图"],
    "主体位置":["居中","平铺","上","左上","右上","下","左下","右下","左","右"],
}

exports.fontStyleObject = {
    //风格属性，尽量以复杂到简单，重到轻，多到少，大到小的方式排列,后续字体选择算法会去计算
    "艺术风格":["毛笔","手绘","卡通","写实"],
    "衬线":["有衬线","无衬线"],
    "线条特征":["弯曲","圆滑","圆润","刚硬"],
    "书写方式":["手写","仿手写","机刷"],
    "笔划复杂度":["超复杂","复杂","简单","极简"],//---根据所选此条
    "粗细程度":["heavy","bold","regular","light","extraLight"],//--此项为整体字体粗细,标题大概率为bold,内容大概率为regular,
    "简繁英":["繁","简","英"],//--选择繁体的设计只能选择繁体,而选择简体的设计,简繁两种都可以选,英文只能选英文
}



//vvvvvvvvv以下全部是素材实体vvvvvvv


exports.backgroundStyleList = [
    ["沉稳","自然景观","蓝",3,3,3,"横构图","平铺","天空云彩"]
]




exports.fontStyleList = [
        //此处保存各字体对应的标签
        //整体风格；现代商务,pop招贴,可爱少女,文艺清新,狂放霸气,简单大气,现代科技,朋克工业
        ["卡通","无衬线","圆润","仿手写","复杂","heavy","简","包图小白体"],
        ["手绘","无衬线","弯曲","手写","复杂","regular","简","沐瑶软笔手写体"],
        ["写实","无衬线","刚硬","机刷","简单","heavy","简","庞门正道标题体"],
        ["写实","无衬线","刚硬","机刷","简单","bold","简","OPPOSans"],
        ["写实","无衬线","刚硬","机刷","简单","light","繁","等粗Light"],
        ["写实","无衬线","刚硬","机刷","简单","heavy","繁","等粗黑Heavy"],
        ["毛笔","有衬线","弯曲","手写","复杂","heavy","简","旁门正道粗书体"],
        ["手绘","无衬线","弯曲","仿手写","简单","regular","简","手写1"],
        ["手绘","无衬线","弯曲","仿手写","简单","regular","简","手写2"],

        ["毛笔","有衬线","弯曲","手写","复杂","bold","繁","刻石录颜体"],
        ["手绘","有衬线","弯曲","手写","简单","light","繁","王汉宗粗钢体"],
        ["毛笔","有衬线","弯曲","仿手写","复杂","bold","繁","王漢宗勘亭流繁"],
        ["手绘","有衬线","弯曲","仿手写","复杂","bold","繁","王漢宗中楷體破音一"],
        ["手绘","有衬线","弯曲","仿手写","复杂","bold","繁","王漢宗中明體注音"],
        ["手绘","有衬线","弯曲","仿手写","复杂","bold","繁","王漢宗勘亭流繁"],


        ["写实","有衬线","刚硬","机刷","简单","bold","简","思源宋体Bold"],
        ["写实","有衬线","刚硬","机刷","简单","Reguler","简","思源宋体Reguler"],


        ["写实","无衬线","圆润","机刷","简单","heavy","繁","思源柔黑Heavy"],
        ["写实","无衬线","圆润","机刷","简单","bold","繁","思源柔黑Bold"],
        ["写实","无衬线","圆润","机刷","简单","Reguler","繁","思源柔黑Reguler"],
        ["写实","无衬线","圆润","机刷","简单","light","繁","思源柔黑Light"],
        ["写实","无衬线","圆润","机刷","简单","extraLight","繁","思源柔黑ExtraLight"],

        ["写实","无衬线","刚硬","机刷","简单","heavy","简","思源黑体Heavy"],
        ["写实","无衬线","刚硬","机刷","简单","bold","简","思源黑体Bold"],
        ["写实","无衬线","刚硬","机刷","简单","Reguler","简","思源黑体Reguler"],
        ["写实","无衬线","刚硬","机刷","简单","light","简","思源黑体Light"],
        ["写实","无衬线","刚硬","机刷","简单","extraLight","简","思源黑体ExtraLight"],
    ]